## Intro to SQL

### Selecting Columns

####  Onboarding | Tables

In [ ]:
# 5000 films
# films: id|title|release_year|country|duration|language|certification|gross|budget
# people: id|name|birthdate|deathdate
# reviews: id|film_id|num_user|num_critic|imdb_score|num_votes|facebook_likes
# roles: id|film_id|person_id|role

# who is the first person listed in the people table?
# 50 Cent

#### Onboarding | Query Result

In [1]:
# SELECT name FROM people;
# Who is the second person listed in the query result?
# A. Michael Baldwin

#### Onboarding | Errors

In [ ]:
# error editing
# Two types of errors from code:
"""
-- Try running me!
'DataCamp <3 SQL'
AS result;

-- syntax error at or near "'DataCamp <3 SQL'" LINE 2: 'DataCamp <3 SQL' ^
"""
# fix error
"""
SELECT 'DataCamp <3 SQL'
AS result;
"""

#### Onboarding | Multi-step Exercises

In [2]:
# 1/3
# submint query 
"""
SELECT 'SQL'
AS result;
"""
# 2/3
# change 'SQL' to 'SQL is'
"""
SELECT 'SQL is'
AS result;
"""
# 3/3
# change 'SQL is' to 'SQL is cool'
"""
SELECT 'SQL is cool'
AS result;
"""

"\nSELECT 'SQL is cool'\nAS result;\n"

#### Beginning your SQL journey

In [ ]:
# SQL => Structured Query Language
# language for interacting with data stored in a relational database
# collection of tables
# employees: id | name | age | nationality 

# rows -> records
# columns -> fields

# How many fields does the employees table above contain?
# 4 
# The table contains 4 coluns or fields

#### SELECTing single columns

In [ ]:
# focus of querying databases
# A query is a request for data from a database table

# select data from table
# SELECT

# query selects the name column from the people table:
"""
SELECT name
FROM people;
"""
# keywords: SELECT | FROM
# keywords should be uppercase to distinguish from other parts of the query
# include semicolon (;) at the end of the query | tells Sql where the end of query is

# 1/3
# Select the title column from the films table.

"""
SELECT title
FROM films;
"""

# 2/3
# Select the release_year column from the films table.
"""
SELECT release_year
FROM films;
"""

# 3/3
# Select the name of each person in the people table.
"""
SELECT name
FROM people;
"""

#### SELECTing multiple columns

In [ ]:
# In the real world, you will often want to select multiple columns.
# To select multiple columns from a table, simply separate the column names with commas!

# query selects two columns, name and birthdate, from the people table:
"""
SELECT name, birthdate
FROM people;
"""
# select all columns from a table.
"""
SELECT *
FROM people;
"""

# If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

"""
SELECT *
FROM people
LIMIT 10;
"""

# films: id | title | release_year \ country | duration | language | certification | fross | budget

# 1/4
# Get the title of every film from the films table.
"""
SELECT title
FROM films;
"""

# 2/4
# Get the title and release year for every film.
"""
SELECT title, release_year
FROM films;
"""

# 3/4
# Get the title, release year and country for every film.
"""
SELECT title, release_year, country
FROM films;
"""

# 4/4
# Get all columns from the films table.
"""
SELECT *
FROM films;
"""

#### SELECT DISTINCT

In [ ]:
# results inculde duplicate values
# DISTINCT allows for selection of unique values

# useful if, for example, you're interested in knowing which languages are represented in the films table:
"""
SELECT DISTINCT language
FROM films;
"""

# 1/3
# Get all the unique countries represented in the films table.
"""
SELECT DISTINCT country 
FROM films; 
"""

# 2/3
# Get all the different film certifications from the films table.
"""
SELECT DISTINCT certification
FROM films;
"""

# 3/3
# Get the different types of film roles from the roles table.
"""
SELECT DISTINCT role
FROM roles;
"""
# query result
"""
role
director
actor
"""

#### Learning to COUNT

In [ ]:
#  if you want to count the number of employees in your employees table, use COUNT() 
# COUNT() function returns the number of rows in one or more columns

# rows -> records
# columns -> fields

# this code gives the number of rows in the people table:
"""
SELECT COUNT(*)
FROM people;
"""
# 8397

# How many records are contained in the reviews table?
"""
SELECT COUNT(*)
FROM reviews; 
"""
# 4968

#### Practice with COUNT

In [ ]:
# COUNT(*) tells you how many rows, records are in a table.
# if you want to count the number of non-missing values in a particular column, you can call COUNT() on just that column.

# count the number of birth dates present in the people table:
"""
SELECT COUNT(birthdate)
FROM people; 
"""
# 6152

# also common to combine COUNT() with DISTINCT to count the number of distinct values in a column.
# this query counts the number of distinct birth dates contained in the people table:
"""
SELECT COUNT(DISTINCT birthdate)
FROM people; 
"""
# 5398

# 1/5
# Count the number of rows in the people table.
"""
SELECT COUNT(*)
FROM people; 
"""
# 8397

# 2/5
# Count the number of (non-missing) birth dates in the people table.
"""
SELECT COUNT(birthdate)
FROM people;
"""
# 6152

# 3/5
# Count the number of unique birth dates in the people table.
"""
SELECT COUNT(DISTINCT birthdate)
FROM people;
"""
# 5398

# 4/5
# Count the number of unique languages in the films table.
"""
SELECT COUNT(DISTINCT language)
FROM films;
"""
# 41

# 5/5
# Count the number of unique countries in the films table.
"""
SELECT COUNT(DISTINCT country)
FROM films; 
"""
# 64